app/controllers/sessions_controller.rb

   def create
    user = User.find_by(email_id: params[:session][:email_id].downcase)
---
SELECT `users`.* FROM `users` WHERE `users`.`email_id` = 'palak@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1