app/controllers/users_controller.rb

INSERT INTO `users` (`address`, `created_at`, `email_id`, `password_digest`, `phone_no`, `remember_token`, `updated_at`, `username`) VALUES ('foobar', '2014-03-31 15:46:09', 'user@example.com', '$2a$04$vFmG6a8Xjn.p86gtaNC8r.xgdtpbNt5AjokDu1h7cioND.jl5holu', 'foobar', 'fd5a441f6f41388b6a1c72bddb5f6c6e446d91ff', '2014-03-31 15:46:09', 'Example User')
---
	def create
	    @user = User.new(user_params)
	    if @user.save